JIRA/InformationRegisters/ЗадачиJIRA.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.16">
	<InformationRegister>
		<Properties>
			<Name>ЗадачиJIRA</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Статус</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Описание</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>НазваниеЗадачи</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>200</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

JIRA/InformationRegisters/ЗадачиJIRA/Forms/ФормаСписка/Ext/Form/Module.bsl
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	МассивДанных = ПолучитьJSONЗадач();
	МассивОтбор = МассивДанных["issues"];

	Для каждого  ЭлементМассива Из МассивОтбор Цикл 
		                                                                                         
		СтруктураПолей = ЭлементМассива.fields;
		
		Описание = ?(СтруктураПолей.description = "null","",СтруктураПолей.description);
		НазваниеЗадачи = СтруктураПолей.summary;
		Статус = СтруктураПолей.status.name;
			
		МенеджерЗаписи = РегистрыСведений.ЗадачиJIRA.СоздатьМенеджерЗаписи();
		МенеджерЗаписи.НазваниеЗадачи = НазваниеЗадачи;
		МенеджерЗаписи.Описание = Описание;
		МенеджерЗаписи.Статус = Статус;
		МенеджерЗаписи.Записать();
			
	КонецЦикла;
		
КонецПроцедуры

&НаСервере
Функция ПолучитьJSONЗадач()
	
	Токен = Константы.ТокенДляJIRAВBASE64.Получить();
	
	SSL = Новый ЗащищенноеСоединениеOpenSSL;

	Соединение = Новый HTTPСоединение("testtodolist.atlassian.net",443,,,,30,SSL);
	
	АдресРесурса = "/rest/api/2/search";
	
	Заголовки = Новый Соответствие;
	Заголовки.Вставить("Content-Type", "application/json; charset=utf-8"); 
	Заголовки.Вставить("Authorization", "Basic "+ Токен); 
	
	ЗапросСЗаголовками = Новый HTTPЗапрос(АдресРесурса,Заголовки);
	
	Ответ = Соединение.ВызватьHTTPМетод("GET", ЗапросСЗаголовками);
	
	Если Ответ.КодСостояния = 200 Тогда
		
		ТелоОтвета = Ответ.ПолучитьТелоКакСтроку();
		Результат = РаботаСJSON.ПрочитатьТекстJSON(ТелоОтвета);
		Возврат Результат; 
		
	Иначе
		Сообщение = Новый СообщениеПользователю;
		Сообщение.Текст = СтрШаблон("Не удалось выполнить запрос, код состояния %1", Ответ.КодСостояния);
		Сообщение.Сообщить();
		Возврат Сообщение
	КонецЕсли
		
КонецФункции
